* DagStat 2025 tutorial: Generalized pairwise comparisons

*Instructors:* Johan Verbeeck (University of Hasselt, Belgium), Brice
Ozenne (University of Copenhagen, Denmark)

*Location:* Berlin 10099, Humboldt-Universität zu Berlin, Unter den Linden 6, room D24-1.406.

*Date:* 23/03/2025

*Content*: you will find here the slides (=doc= directory), codes
(=.R= files) and data (=data= directory) used for the tutorial.
- =BuyseTest_intro.R=: general introduction to the BuyseTest package
- =revisit_CHARM.R=: analysis of composite endpoint (death, hospitalization) via GPC
- =revisit_prodige.R=: assessing benefit-risk (death, quality of life) via GPC
- =revisit_EB.R=: analysis of a small sample trial by GPC


* Installation of the software

First you should install:
- the R software (https://www.r-project.org/)
- an integrated development environment (IDE) such as R studio
  (https://posit.co/download/rstudio-desktop/)

Then open your IDE and download the BuyseTest package from =CRAN=:
#+BEGIN_SRC R :exports both :eval never
install.packages("BuyseTest")
#+END_SRC

or from =GitHub=:
#+BEGIN_SRC R :exports both :eval never
library(remotes)
install_github("bozenne/BuyseTest")
#+END_SRC

The CRAN version is the latest stable version and the Github version
is the latest development version. Either way you should obtain
version 3.1.0 (as of March 2025):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
packageVersion("BuyseTest")
#+END_SRC

#+RESULTS:
: [1] '3.1.0'

To run one of the R scripts you will also need the packages =dplyr=
and =survminer=. 

* How to run the code

You will need to use your own computer to run the R code provided in
the tutorial. After having installed the R software and the BuyseTest
package (see previous paragraph), you can access the R code by either:
- clicking on top right green button 'Code' and then on 'Download
  ZIP'. Once the download is completed you just have to unzip
  "tutorial-DagStat2025-GPC-main.zip" and then you can access the =.R=
  files.
- clicking on a specific =.R= file and either copy paste the code or
  click on the download button ↓ (top right, next to 'Raw')
  
